{
  "0.1.0": {
    "en": "v0.1.0 App store RC1"
  },
  "1.0.0": {
    "en": "First app store release"
  },
  "1.0.1": {
    "en": "Fixed multiple cars support. App store fixes."
  },
  "1.1.0": {
    "en": "Bluelink (Hyundai) driver added. Kia PHEV support added. EU, CA, US regions added."
  },
  "1.2.0": {
    "en": "Fix dual flow triggers, chager labels, settings and change settings log. Readme and instructions update. Notify device as unavailable on restart. Improved car-active detection. Added ABRP DC fast charger state."
  },
  "1.3.0": {
    "en": "Fix target temp setting. Fix target temp scale. Stability improvements. Added command queueing. Added force live via cloud (HTTP GET). Changed forced poll method to GPS."
  },
  "1.4.0": {
    "en": "Stability improvements. Fix pairing. Fix log length. Climate control check engine on. Improved queuing. Added rate limiting. Improved car active detection. Prevent dual Homey active triggering."
  },
  "1.5.0": {
    "en": "Added action flow cards for A/C on/off, Defrost on/off, set Temp. Added lat/lon capabilities/flow tokens (repair needed). Fix step 0.5 target temp. Improved pairing."
  },
  "1.6.0": {
    "en": "Fix live data from app and flow. Fix condition cards. Added flow cards for car moving, parked, closed&locked."
  },
  "1.6.1": {
    "en": "Added short URL for remote force. Improved parked detection. Disable/Enable live data and control from flow (privacy mode)."
  },
  "1.7.0": {
    "en": "Added Estimated Time To Home (ETTH) and Heading Home (repair needed). Updated icons."
  },
  "2.0.0": {
    "en": "App rewrite (repair needed). Added charge on/off. Added Google Directions ETTH. Added flowcards. Added parked address. Removed Heading Home. Improved reverse Geo. bluelinky@5.2.3 kuvork@5.4.4"
  },
  "2.0.1": {
    "en": "Fix ETTH when just parked. Improved car parked detection. Improved error handling. bluelinky@6.0.0 kuvork@6.0.0-alpha4"
  },
  "2.0.3": {
    "en": "Fix crash when no batSoc (Kia Soul)"
  },
  "2.0.2": {
    "en": "Fix crash when no batSoc (Kia Soul)"
  },
  "2.1.0": {
    "en": "Quick fix not able to login for Kia. Hyundai is WIP. Bluelinky removed. kuvork@6.2.0-alpha.1"
  },
  "2.1.1": {
    "en": "Quick fix not able to login for Kia and Hyundai. kuvork@6.2.0-alpha.5"
  },
  "2.1.2": {
    "en": "Improved server info after app start. kuvork@6.2.2"
  },
  "2.2.0": {
    "en": "Added support for Kia Ceed ICE."
  },
  "2.3.0": {
    "en": "Added charge limits. Remove EV-capabilities for ICE cars. Improved pairing error feedback. Improved car parked detection. Fixed HTTPS timeout. Log changes Homey V6. Kuvork removed. Bluelinky@7.0.1"
  },
  "2.4.0": {
    "en": "Added send Navigation destination to car. Fixed car parked detection. Other minor fixes. Readme updated."
  },
  "2.4.1": {
    "en": "bluelinky@7.1.0 (fixes login issues new Kia/Hyundai accounts)."
  },
  "2.4.2": {
    "en": "bluelinky@7.2.0 (fixes login issues special characters and old UVO/Bluelink accounts)."
  },
  "2.4.3": {
    "en": "Fix isParked flowcard. Improved watchdog. Improved app icon."
  },
  "2.4.4": {
    "en": "Quickfix timestamp login issues. bluelinky@7.2.1 + hack"
  },
  "2.4.5": {
    "en": "bluelinky@7.2.2 (timestamps updated)"
  },
  "2.4.6": {
    "en": "bluelinky timestamps updated"
  },
  "2.5.0": {
    "en": "bluelinky@7.3.0 (auto timestamps updates). Login caching for reduced API calls. Default update intervals increased. Improved error logging."
  },
  "2.5.1": {
    "en": "Improved handling of quotum error. Improved watchdog."
  },
  "2.5.2": {
    "en": "bluelinky@7.3.0. Fix google ETTH when parked."
  },
  "2.6.0": {
    "en": "bluelinky@7.4.1. Improved defrost control. Add official app language select (EU only)."
  },
  "2.6.1": {
    "en": "bluelinky@7.5.0. Fix getChargeTargets for PHEV/HEV cars."
  },
  "2.6.2": {
    "en": "Fix getChargeTargets for PHEV/HEV cars."
  },
  "2.7.0": {
    "en": "Added support for Kia Sorento PHEV. Removed chargeTargets for PHEV."
  },
  "2.7.1": {
    "en": "bluelinky@7.6.0 (fixes login issues with new Kia accounts)."
  },
  "2.7.2": {
    "en": "bluelinky@7.6.0 (fixes login issues with new Hyundai accounts)."
  },
  "2.7.3": {
    "en": "bluelinky@7.6.2"
  },
  "2.7.4": {
    "en": "Swedish translation added."
  },
  "2.7.7": {
    "en": "bluelinky@7.6.3 (immplement new timestamps and appId)."
  },
  "2.7.8": {
    "en": "bluelinky@7.6.4 (optimized stamp fetching)."
  },
  "2.7.9": {
    "en": "bluelinky@7.6.5 (new stamp strategy)."
  },
  "2.8.0": {
    "en": "bluelinky@7.6.6 (stamp bug fixed)."
  },
  "2.9.0": {
    "en": "Renamed alarm_batt, meter_odo, meter_range, meter_speed capabilities. Removed state fix after refresh. Enabled local stamp generation. bluelinky@8.0.0-alpha.1. Debug mode on."
  },
  "2.9.1": {
    "en": "Renamed alarm_batt, meter_odo, meter_range, meter_speed capabilities. Removed state fix after refresh. Enabled local stamp generation. Added bluelinky startup watchdog. bluelinky@8.0.0-alpha.1."
  },
  "2.9.2": {
    "en": "Fixed uncaught rejections. Enabled charge state fix after refresh. Optimized queue handling."
  },
  "2.9.3": {
    "en": "Disabled charge state fix after refresh by default. Added setting to enable charge state fix after refresh."
  },
  "2.9.4": {
    "en": "Ignore 0 odometer reports."
  },
  "2.9.5": {
    "en": "Ignore 0 odometer reports second attempt."
  },
  "2.9.6": {
    "en": "Ignore 0 odometer reports third attempt. Keep AC target temperature after shutoff."
  },
  "2.9.7": {
    "en": "Fix new Auth for EU region. bluelinky@8.0.0-alpha.2."
  },
  "2.9.8": {
    "en": "Fix new Auth for EU region. bluelinky@8.1.1"
  },
  "2.9.9": {
    "en": "Fix new Auth for EU region. bluelinky@8.1.2"
  },
  "3.0.0": {
    "en": "Fix reverse geo. Reversed Closed and Locked status. bluelinky@8.2.1"
  },
  "3.0.1": {
    "en": "Stability improvements."
  },
  "3.0.2": {
    "en": "Multiple trigger flow cards added."
  }
}
