{
  "0.1.0": {
    "en": "v0.1.0 App store RC1"
  },
  "1.0.0": {
    "en": "First app store release"
  },
  "1.0.1": {
    "en": "Fixed multiple cars support. App store fixes."
  },
  "1.1.0": {
    "en": "Bluelink (Hyundai) driver added. Kia PHEV support added. EU, CA, US regions added."
  },
  "1.2.0": {
    "en": "Fix dual flow triggers, chager labels, settings and change settings log. Readme and instructions update. Notify device as unavailable on restart. Improved car-active detection. Added ABRP DC fast charger state."
  },
  "1.3.0": {
    "en": "Fix target temp setting. Fix target temp scale. Stability improvements. Added command queueing. Added force live via cloud (HTTP GET). Changed forced poll method to GPS."
  },
  "1.4.0": {
    "en": "Stability improvements. Fix pairing. Fix log length. Climate control check engine on. Improved queuing. Added rate limiting. Improved car active detection. Prevent dual Homey active triggering."
  },
  "1.5.0": {
    "en": "Added action flow cards for A/C on/off, Defrost on/off, set Temp. Added lat/lon capabilities/flow tokens (repair needed). Fix step 0.5 target temp. Improved pairing."
  },
  "1.6.0": {
    "en": "Fix live data from app and flow. Fix condition cards. Added flow cards for car moving, parked, closed&locked."
  },
  "1.6.1": {
    "en": "Added short URL for remote force. Improved parked detection. Disable/Enable live data and control from flow (privacy mode)."
  },
  "1.7.0": {
    "en": "Added Estimated Time To Home (ETTH) and Heading Home (repair needed). Updated icons."
  },
  "2.0.0": {
    "en": "App rewrite (repair needed). Added charge on/off. Added Google Directions ETTH. Added flowcards. Added parked address. Removed Heading Home. Improved reverse Geo. bluelinky@5.2.3 kuvork@5.4.4"
  },
  "2.0.1": {
    "en": "Fix ETTH when just parked. Improved car parked detection. Improved error handling. bluelinky@6.0.0 kuvork@6.0.0-alpha4"
  },
  "2.0.3": {
    "en": "Fix crash when no batSoc (Kia Soul)"
  },
  "2.0.2": {
    "en": "Fix crash when no batSoc (Kia Soul)"
  }
}
